//1 2 6 5 7 8 4 3 9  13
//1 3 2 5 9 6 7 8 4  4
//1 3 2 7 9 6 5 4 8
//1 7 8 4 3 9 6 5 2
//1 9 6 7 4 8 5 3 2
//2 6 8 9 3 4 5 1 7  
//2 6 8 9 5 1 7 3 4
//4 3 9 1 7 8 6 5 2
//4 5 6 7 9 8 3 2 1
//5 2 6 9 7 8 4 1 3
//5 7 8 1 2 6 4 3 9
//5 9 6 1 3 2 7 8 4
//6 3 4 8 5 1 9 2 7
//7 4 8 1 9 6 5 3 2
//7 9 6 1 3 2 5 4 8
//7 9 8 4 5 6 3 2 1
//8 5 1 6 3 4 9 2 7
//9 3 4 2 6 8 5 1 7  17
//9 5 1 2 6 8 7 3 4
//9 7 8 5 2 6 4 1 3


//品+品=品
//使用计算机便利解方程
func main() {

	//flag := false
	var arr []int = []int{0, 0, 0, 0, 0, 0, 0, 0, 0}

	for a := 1; a < 10; a++ {
		for b := 1; b < 10; b++ {
			for c := 1; c < 10; c++ {
				for d := 1; d < 10; d++ {
					for e := 1; e < 10; e++ {
						for f := 1; f < 10; f++ {
							for g := 1; g < 10; g++ {
								for h := 1; h < 10; h++ {
									for i := 1; i < 10; i++ {

										if (a*(e*10+f)+d*(b*10+c))*(h*10+i) == g*(b*10+c)*(e*10+f) {
											arr[0] = a
											arr[1] = b
											arr[2] = c
											arr[3] = d
											arr[4] = e
											arr[5] = f
											arr[6] = g
											arr[7] = h
											arr[8] = i
											//剔除掉有重复数字的数据。可以优化。
											if a != b && a != c && a != d && a != e && a != f && a != g && a != h && a != i {
												if b != c && b != d && b != e && b != f && b != g && b != h && b != i {
													if c != d && c != e && c != f && c != g && c != h && c != i {
														if d != e && d != f && d != g && d != h && d != i {
															if e != f && e != g && e != h && e != i {

																if f != g && f != h && f != i {
																	if g != h && g != i {
																		if h != i {
																			fmt.Println(a, b, c, d, e, f, g, h, i)
																		}
																	}

																}
															}
														}
													}
												}
											}

										}
									}
								}
							}
						}
					}
				}
			}

		}
	}

}
